#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Макет = МакетОбработки("МакетЗагрузкиНоменклатуры");   
	ТабДок.Вывести(Макет);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ячейка = ТабДок.Область("R2C1:R2C1");	    
	Элементы.ТабДок.ТекущаяОбласть = Ячейка;
КонецПроцедуры

#КонецОбласти


//////////////////////////////////////////


#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти


//////////////////////////////////////////


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПечатнуюФорму(Команда)
	ЗагрузитьНоменклатуруНаСервере();
	СформироватьПечатнуюФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Сохранение пересчета";
	Диалог.ПолноеИмяФайла = "Пересчет.xlsx";  
	Диалог.Фильтр = "Файл Excel .xlsx |*.xlsx";
	Диалог.Показать(Новый ОписаниеОповещения("ПослеСохраненияПечатнойФормы", ЭтотОбъект));	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьТабДок(Команда)
	ОбновитьТабДокНаСервере();
КонецПроцедуры



#КонецОбласти


//////////////////////////////////////////


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МакетОбработки(Имя) 
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(Имя);
КонецФункции 

&НаСервере
Процедура ЗагрузитьНоменклатуруНаСервере()
	МассивНоменклатуры = Новый Массив; 
	Сч = 2;
	Следующий = Истина;
	
	Пока Следующий Цикл
	  Ячейка = ТабДок.Область(СтрШаблон("R%1C1:R%1C1", Сч));
	  МассивНоменклатуры.Добавить(Ячейка.Текст);  
		Следующий = ЗначениеЗаполнено(ТабДок.Область(СтрШаблон("R%1C1:R%1C1", Сч + 1)).Текст);	
		Сч = Сч + 1;	
	КонецЦикла;

	СписокНоменклатуры.Загрузить(ПолучитьСписокНоменклатуры(МассивНоменклатуры));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНоменклатуры(МассивНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ВесМожноУказыватьВДокументах КАК ВесМожноУказыватьВДокументах
		|ПОМЕСТИТЬ втСписокНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование В(&МассивНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА НЕ втСписокНоменклатуры.ВесМожноУказыватьВДокументах
		|			ТОГДА ШтрихкодыНоменклатуры.Штрихкод
		|	КОНЕЦ КАК Штрихкод,
		|	ВЫБОР
		|		КОГДА втСписокНоменклатуры.ВесМожноУказыватьВДокументах
		|			ТОГДА КодыТоваровПодключаемогоОборудованияOffline.Код - 100000 + 1
		|	КОНЕЦ КАК КодПЛУ
		|ИЗ
		|	втСписокНоменклатуры КАК втСписокНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО втСписокНоменклатуры.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровПодключаемогоОборудованияOffline КАК КодыТоваровПодключаемогоОборудованияOffline
		|		ПО втСписокНоменклатуры.Номенклатура = КодыТоваровПодключаемогоОборудованияOffline.Номенклатура";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка;
КонецФункции 

&НаСервере
Процедура СформироватьПечатнуюФормуНаСервере()
	
	Макет = МакетОбработки("МакетПечатнойФормы");
	Шапка 				= Макет.ПолучитьОбласть("Шапка"); 
	ШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	ТабДок.Очистить();
	ТабДок.Вывести(Шапка);
	ТабДок.Вывести(ШапкаТаблицы); 
	
	БуфНоменклатура = Неопределено;
	Сч = 1;
	Для каждого СтрНоменклатуры Из СписокНоменклатуры Цикл
			
		Если Сч = 1 Тогда		               
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры, СтрНоменклатуры);    
			БуфНоменклатура = СтрНоменклатуры.Номенклатура;  
			Сч = Сч + 1;
			Продолжить;	
		КонецЕсли;
	
		Если СтрНоменклатуры.Номенклатура = БуфНоменклатура Тогда
			 СтрокаТаблицы.Параметры.Штрихкод	 = СтрокаТаблицы.Параметры.Штрихкод	 
			 	+ Символы.ПС 
				+ СтрНоменклатуры.Штрихкод; 
			Иначе
				ТабДок.Вывести(СтрокаТаблицы);
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры, СтрНоменклатуры);    
				БуфНоменклатура = СтрНоменклатуры.Номенклатура;
		КонецЕсли; 
		
		Если Сч = СписокНоменклатуры.Количество() Тогда		
			  ТабДок.Вывести(СтрокаТаблицы);
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;
	
	ТабДок.Вывести(ПодвалТаблицы);
КонецПроцедуры

&НаСервере
Процедура ОбновитьТабДокНаСервере()  
	ТабДок.Очистить();
	Макет = МакетОбработки("МакетЗагрузкиНоменклатуры");   
	ТабДок.Вывести(Макет);
  Ячейка = ТабДок.Область("R2C1:R2C1");	    
	Элементы.ТабДок.ТекущаяОбласть = Ячейка;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеСохраненияПечатнойФормы(Результат, ДополнительныеПараметры) Экспорт 

	Если Результат.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 

	ПутьКФайлу = Результат[0];	
	ТабДок.Записать(ПутьКФайлу,ТипФайлаТабличногоДокумента.XLSX);	
	
КонецПроцедуры 

#КонецОбласти
