#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Макет = МакетОбработки("МакетЗагрузкиНоменклатуры");   
	ТабДок.Вывести(Макет);
КонецПроцедуры

#КонецОбласти


//////////////////////////////////////////


#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	ЗагрузитьНоменклатуруНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПечатнуюФорму(Команда)
	СформироватьПечатнуюФормуНаСервере();
КонецПроцедуры

#КонецОбласти


//////////////////////////////////////////


#Область ОбработчикиКомандФормы

#КонецОбласти


//////////////////////////////////////////


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МакетОбработки(Имя) 
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(Имя);
КонецФункции 

&НаСервере
Процедура ЗагрузитьНоменклатуруНаСервере()
	МассивНоменклатуры = Новый Массив; 
	Сч = 2;
	Следующий = Истина;
	
	Пока Следующий Цикл
	  Ячейка = ТабДок.Область(СтрШаблон("R%1C1:R%1C1", Сч));
	  МассивНоменклатуры.Добавить(Ячейка.Текст);  
		Следующий = ЗначениеЗаполнено(ТабДок.Область(СтрШаблон("R%1C1:R%1C1", Сч + 1)).Текст);	
		Сч = Сч + 1;	
	КонецЦикла;

	СписокНоменклатуры.Загрузить(ПолучитьСписокНоменклатуры(МассивНоменклатуры));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНоменклатуры(МассивНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ВесМожноУказыватьВДокументах КАК ВесМожноУказыватьВДокументах
		|ПОМЕСТИТЬ втСписокНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование В(&МассивНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА НЕ втСписокНоменклатуры.ВесМожноУказыватьВДокументах
		|			ТОГДА ШтрихкодыНоменклатуры.Штрихкод
		|	КОНЕЦ КАК Штрихкод,
		|	ВЫБОР
		|		КОГДА втСписокНоменклатуры.ВесМожноУказыватьВДокументах
		|			ТОГДА КодыТоваровПодключаемогоОборудованияOffline.Код - 100000 + 1
		|	КОНЕЦ КАК КодПЛУ
		|ИЗ
		|	втСписокНоменклатуры КАК втСписокНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО втСписокНоменклатуры.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровПодключаемогоОборудованияOffline КАК КодыТоваровПодключаемогоОборудованияOffline
		|		ПО втСписокНоменклатуры.Номенклатура = КодыТоваровПодключаемогоОборудованияOffline.Номенклатура";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка;
КонецФункции 

&НаСервере
Процедура СформироватьПечатнуюФормуНаСервере()
	
	Макет = МакетОбработки("МакетПечатнойФормы");
	Шапка 				= Макет.ПолучитьОбласть("Шапка"); 
	ШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	ТабДок.Очистить();
	ТабДок.Вывести(Шапка);
	ТабДок.Вывести(ШапкаТаблицы); 
	
	Для каждого СтрНоменклатуры Из СписокНоменклатуры Цикл
	
		 ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры, СтрНоменклатуры);
	   ТабДок.Вывести(СтрокаТаблицы);
	КонецЦикла;
	
	ТабДок.Вывести(ПодвалТаблицы);

	
	
	
	
	
КонецПроцедуры


#КонецОбласти
